In [76]:
#import pandas, load in as shorthand so we can use it easier- don't have to write pandas every time
import pandas as pd

In [77]:
#load in data from csv files
df_test = pd.read_csv('test_data.csv')
df_students = pd.read_csv('students.csv')
df_sites = pd.read_csv('sites.csv')

In [78]:
#print first 5 rows of the test DataFrame
df_test.head()

    test_date     last_name   first_name  score                  school_name
0  2017-10-01          Asis  Atif Sifiso      1  Hamilton Senior High School
1  2017-10-01      Savatier         Jaga      3  Hamilton Senior High School
2  2017-10-01         Wruck      Arnfinn      3  Hamilton Senior High School
3  2017-10-01  Venera Kohut      Jolanka      4  Hamilton Senior High School
4  2017-10-01      Benetton       Lorcan      4  Hamilton Senior High School

In [79]:
#print first 5 rows of the students DataFrame
df_students.head()

   student_id     last_name   first_name  site_id
0           1          Asis  Atif Sifiso        1
1           2      Savatier         Jaga        1
2           3         Wruck      Arnfinn        1
3           4  Venera Kohut      Jolanka        1
4           5      Benetton       Lorcan        1

In [80]:
#print first 5 rows of the sites DataFrame
df_sites.head()

   site_id                          site_name
0        1        Hamilton Senior High School
1        2  James K. Polk Preparatory Academy
2        3     Rutherford B Hayes Junior High
3        4                  FDR Middle School
4        5                     The New School

In [81]:
#get rid of all capitalization in first names, last names, and school names in all 3 dataframes where applicable
df_students['first_name'] = df_students['first_name'].str.lower()
df_students['last_name'] = df_students['last_name'].str.lower()

df_test['first_name'] = df_test['first_name'].str.lower()
df_test['last_name'] = df_test['last_name'].str.lower()
df_test['school_name'] = df_test['school_name'].str.lower()

df_sites['site_name'] = df_sites['site_name'].str.lower()

#get rid of all spaces in first names, last names, and school names in all 3 dataframes where applicable
df_students['first_name'] = df_students['first_name'].str.strip()
df_students['last_name'] = df_students['last_name'].str.strip()

df_test['first_name'] = df_test['first_name'].str.strip()
df_test['last_name'] = df_test['last_name'].str.strip()
df_test['school_name'] = df_test['school_name'].str.strip()

df_sites['site_name'] = df_sites['site_name'].str.strip()

#get rid of all punctuation in first names, last names, and school names in all 3 dataframes where applicable
df_students['first_name'] = df_students['first_name'].str.replace(r'[^\w\s]', '', regex=True)
df_students['last_name'] = df_students['last_name'].str.replace(r'[^\w\s]', '', regex=True)

df_test['first_name'] = df_test['first_name'].str.replace(r'[^\w\s]', '', regex=True)
df_test['last_name'] = df_test['last_name'].str.replace(r'[^\w\s]', '', regex=True)
df_test['school_name'] = df_test['school_name'].str.replace(r'[^\w\s]', '', regex=True)

df_sites['site_name'] = df_sites['site_name'].str.replace(r'[^\w\s]', '', regex=True)

In [82]:
#rename the test dataframe's 'school_name' column to 'site_name' for consistency with sites dataframe
df_test.rename(columns={'school_name': 'site_name'}, inplace=True)

In [83]:
#merge students and sites dataframes on the 'site_id' column, using an outer join to keep all records from both dataframes, and store the result in a new dataframe called df_students_sites
df_students_sites = pd.merge(df_students, df_sites, how='outer', on='site_id')
#print first 5 rows of the merged dataframe
df_students_sites.head()

   student_id     last_name   first_name  site_id                    site_name
0           1          asis  atif sifiso        1  hamilton senior high school
1           2      savatier         jaga        1  hamilton senior high school
2           3         wruck      arnfinn        1  hamilton senior high school
3           4  venera kohut      jolanka        1  hamilton senior high school
4           5      benetton       lorcan        1  hamilton senior high school

In [ ]:
#merge students_sites and test dataframes on the 'first_name' and 'last_name' columns, using a right join to keep all records from the test dataframe, 
#and store the result in a new dataframe called df_merged. Also add an indicator column to show which rows matched and which did not.
df_merged = pd.merge(df_students_sites, df_test, how='right', on=['first_name', 'last_name'], indicator=True)

#make sure student_id and site_id columns are integers, filling in any missing values with 0 before converting to integers
df_merged['student_id'] = df_merged['student_id'].fillna(0).astype('int64')
df_merged['site_id'] = df_merged['site_id'].fillna(0).astype('int64')

#print the first 5 rows of the merged dataframe to check the results
df_merged.head(5)

,student_id,last_name,first_name,site_id,site_name_x,test_date,score,site_name_y,_merge
0,1,asis,atif sifiso,1,hamilton senior high school,2017-10-01,1,hamilton senior high school,both
1,2,savatier,jaga,1,hamilton senior high school,2017-10-01,3,hamilton senior high school,both
2,3,wruck,arnfinn,1,hamilton senior high school,2017-10-01,3,hamilton senior high school,both
3,4,venera kohut,jolanka,1,hamilton senior high school,2017-10-01,4,hamilton senior high school,both
4,5,benetton,lorcan,1,hamilton senior high school,2017-10-01,4,hamilton senior high school,both

In [85]:
#rename 'score' to 'test_score', as specified in the instructions
df_merged.rename(columns={'score': 'test_score'}, inplace=True)

In [86]:
#sort the merged DataFrame by 'student_id' from highest to lowest
df_merged.sort_values(by='student_id', ascending=False, inplace=True)
df_merged.head()

,student_id,last_name,first_name,site_id,site_name_x,test_date,test_score,site_name_y,_merge
99,100,badcock,caitlin r,5,the new school,2017-10-01,3,the new school,both
98,99,nikolov,omolara aishwarya v,5,the new school,2017-10-01,4,the new school,both
97,98,kendrick,sostrate,5,the new school,2017-10-01,1,the new school,both
197,98,kendrick,sostrate,5,the new school,2018-01-09,2,the new school,both
96,97,misra,flavianus h,5,the new school,2017-10-01,3,the new school,both

In [87]:
#drop both the 'site_name' columns, since we don't need them in the final csv
df_merged.drop(columns=['site_name_x', 'site_name_y'], inplace=True)

#print the whole DataFrame
with pd.option_context('display.max_rows', None):
    print(df_merged)

#check how many rows are in the final DataFrame
len(df_merged)

     student_id                 last_name           first_name  site_id  \
99          100                   badcock            caitlin r        5
98           99                   nikolov  omolara aishwarya v        5
97           98                  kendrick             sostrate        5
197          98                  kendrick             sostrate        5
96           97                     misra          flavianus h        5
95           96                  horsfall              jenny h        5
94           95               stainthorpe              helen j        5
93           94                     dries              odell g        5
92           93               van de laar             baxter v        5
91           92                     novak            astridr z        5
191          92                     novak            astridr z        5
90           91                 mathieson             tatana n        5
89           90                     fromm             pravin r        5
88           89                    nikula             klahan t        5
87           88                jollenbeck             rufaro a        5
86           87                o tadhgain           weronika l        5
85           86                   bates v          bruno burto        5
84           85            maedoc bukoski        claudius mael        5
83           84                czajkowski              adwoa j        5
82           83                      teke              yasin j        5
181          82              sheehyheeney            adalynn z        5
81           82              sheehyheeney            adalynn z        5
80           81                    denzil           christen n        5
179          80                   bathory            saewine b        4
79           80                   bathory            saewine b        4
78           79                     carey            nechtan o        4
77           78                 lindstrom               vera z        4
177          78                 lindstrom               vera z        4
176          77                    naggia             harvey p        4
76           77                    naggia             harvey p        4
75           76                   sharman              dipak p        4
74           75                   stablum            eveline g        4
73           74                    paulis           varinius b        4
72           73             hansson recht            mickael j        4
71           72                   rijnder           mayamiko d        4
70           71                       kis                ron n        4
169          70                       ott               huri t        4
69           70                       ott               huri t        4
68           69                    abello              vaast p        4
67           68                   wiegand        dejen jyotsna        4
66           67                    franco             shiva jd        4
65           66                    otieno               hein b        4
64           65                     klaus          dip breen j        4
63           64                     filep         eusebios a o        4
62           63                      hase             oyvind u        4
61           62                  nedbalek            camilla e        4
60           61                 sarkisian             caelan a        4
59           60           abe acquafredda               margit        3
58           59                    dunkel               ervins        3
57           58                    resnik            rhydderch        3
56           57                      zima              khalifa        3
156          57                      zima              khalifa        3
55           56                    mutton               prasad        3
155          56                    mutton               prasad        3
54           55                     mcnee             stanimir        3
154          55                     mcnee             stanimir        3
53           54                      albu              goliath        3
153          54                      albu              goliath        3
52           53                   ventura                 usha        3
152          53                   ventura                 usha        3
51           52                      adam               beylke        3
50           51            aleksandrov iv   tijana aedelbeorht        3
49           50                  agnusdei         mattityahu h        3
149          50                  agnusdei         mattityahu h        3
48           49                  tahtinen           sebire vid        3
47           48                     skala         anita lucius        3
46           47               agostini jr                 liam        3
146          47               agostini jr                 liam        3
45           46                sniegowski                 imke        3
145          46                sniegowski                 imke        3
44           45                   josephs               salomo        3
43           44                     kerry             wandalin        3
143          44                     kerry             wandalin        3
42           43                    becket             severina        3
141          42                      zaal              geghard        3
41           42                      zaal              geghard        3
140          41                poindexter              bertilo        3
40           41                poindexter              bertilo        3
39           40         ferdinand dickens        anila rosella        2
138          39                     soler                ignas        2
38           39                     soler                ignas        2
37           38                      sitz                 jaak        2
36           37                     nejem               mihail        2
35           36      theofylaktossteensen                 oria        2
34           35                      arud                manju        2
134          35                      arud                manju        2
133          34                    kunkel              sandeep        2
33           34                    kunkel              sandeep        2
132          33                     aiken            borghildr        2
32           33                     aiken            borghildr        2
131          32                      vida               regana        2
31           32                      vida               regana        2
30           31                   tosetti   leontius vlatismil        2
29           30                   baumann               deodat        2
129          30                   baumann               deodat        2
28           29                     carey                 line        2
27           28                     groos              seung m        2
127          28                     groos              seung m        2
26           27                       low     theophile yakubu        2
25           26                    oneill                danel        2
24           25                    rotolo          pridbjorn l        2
23           24                   suharto              suharto        2
122          23                   jeffery               noelle        2
22           23                   jeffery               noelle        2
21           22             tomi pitts jr             marianna        2
121          22             tomi pitts jr             marianna        2
20           21                    sharma               jancsi        2
120          21                    sharma               jancsi        2
19           20                   badcock              caitlyn        1
18           19              konstantinov             lucianus        1
118          19              konstantinov             lucianus        1
17           18                  gottlieb                iosef        1
16           17                    hickey              micaela        1
116          17                    hickey              micaela        1
15           16                   vastagh              leticia        1
14           15                    weeber            sophocles        1
13           14                 mcfarland          jessie fran        1
12           13                 krakowski             victoria        1
112          13                 krakowski             victoria        1
11           12                  abrahams               rachna        1
111          12                  abrahams               rachna        1
10           11                 tarpinian                candi        1
9            10                  blanc jr               tamhas        1
8             9                  hall iii         dixon france        1
7             8                 palladino               srecko        1
107           8                 palladino               srecko        1
106           7                nikolkyles              marinko        1
6             7                nikolkyles              marinko        1
5             6                     power     blodwen eleonora        1
104           5                  benetton               lorcan        1
4             5                  benetton               lorcan        1
3             4              venera kohut              jolanka        1
2             3                     wruck              arnfinn        1
102           3                     wruck              arnfinn        1
1             2                  savatier                 jaga        1
101           2                  savatier                 jaga        1
0             1                      asis          atif sifiso        1
180           0                    denzil             christen        0
173           0                    paulis             varinius        0
167           0                   wiegand                   dj        0
168           0                    abello                vaast        0
165           0                    otieno                 hein        0
170           0                       kis                  ron        0
171           0                   rijnder             mayamiko        0
172           0              hanssonrecht            mickael j        0
198           0                   nikolov            aishwarya        0
196           0                     misra            flavianus        0
195           0                  horsfall                jenny        0
194           0               stainthorpe                helen        0
193           0                     dries                odell        0
174           0                   stablum              eveline        0
182           0                      teke                yasin        0
192           0                 vandelaar               baxter        0
175           0                   sharman                dipak        0
190           0                 mathieson            tatiana n        0
189           0                     fromm               pravin        0
188           0                    nikula               klahan        0
187           0                jollenbeck               rufaro        0
186           0                 otadhgain             weronika        0
178           0                     carey              nechtan        0
185           0                     bates          bruno burto        0
184           0                    maedoc             claudius        0
183           0                czajkowski                adwoa        0
166           0                    franco                   jd        0
100           0                      asis                 atif        0
164           0                     klaus             dipbreen        0
115           0                   vastagh             laeticia        0
126           0                       low          theophile y        0
125           0                    oneill                  dan        0
124           0                    rotolo          pridbjorn i        0
123           0           suharto suharto              suharto        0
119           0                   badcock              caitlin        0
117           0                  gottlieb                losef        0
114           0                    weeber                 soph        0
130           0                   tosetti   vlatismil leontius        0
113           0                 mcfarland               jessie        0
110           0                 tarpinian                candy        0
109           0                     blanc               tamhas        0
108           0                      hall                dixon        0
105           0                     power              blodwen        0
103           0               venerakohut              jolanka        0
128           0                      line                carey        0
135           0     theofylaktos steensen                 oria        0
163           0                     filep             eusebios        0
151           0                    beylke                 adam        0
162           0                      hase               oyvind        0
161           0                  medbalek              camilla        0
160           0                 sarkisian               caelan        0
159           0               acquafredda               margit        0
158           0                   sdunkel                ervin        0
157           0                   resnick            rhydderch        0
150           0    edelbeorht aleksandrov               tijana        0
136           0                     nejem             mihail e        0
148           0                 taihtinen            sebirevid        0
147           0                     skala          anitalucius        0
144           0                    salomo               joseph        0
142           0                   beckett             severina        0
139           0  rosella ferdinanddickens                anila        0
137           0                      sitz                  jak        0
199           0                   badcock              caitlin        0

      test_date  test_score      _merge
99   2017-10-01           3        both
98   2017-10-01           4        both
97   2017-10-01           1        both
197  2018-01-09           2        both
96   2017-10-01           3        both
95   2017-10-01           2        both
94   2017-10-01           3        both
93   2017-10-01           3        both
92   2017-10-01           3        both
91   2017-10-01           3        both
191  2018-01-09           2        both
90   2017-10-01           4        both
89   2017-10-01           4        both
88   2017-10-01           4        both
87   2017-10-01           4        both
86   2017-10-01           2        both
85   2017-10-01           4        both
84   2017-10-01           4        both
83   2017-10-01           3        both
82   2017-10-01           1        both
181  2018-01-09           3        both
81   2017-10-01           1        both
80   2017-10-01           1        both
179  2018-01-09           1        both
79   2017-10-01           2        both
78   2017-10-01           2        both
77   2017-10-01           3        both
177  2018-01-09           4        both
176  2018-01-09           3        both
76   2017-10-01           4        both
75   2017-10-01           2        both
74   2017-10-01           3        both
73   2017-10-01           3        both
72   2017-10-01           3        both
71   2017-10-01           3        both
70   2017-10-01           4        both
169  2018-01-09           3        both
69   2017-10-01           1        both
68   2017-10-01           4        both
67   2017-10-01           4        both
66   2017-10-01           1        both
65   2017-10-01           2        both
64   2017-10-01           3        both
63   2017-10-01           4        both
62   2017-10-01           3        both
61   2017-10-01           2        both
60   2017-10-01           1        both
59   2017-10-01           3        both
58   2017-10-01           2        both
57   2017-10-01           4        both
56   2017-10-01           3        both
156  2018-01-09           2        both
55   2017-10-01           1        both
155  2018-01-09           3        both
54   2017-10-01           3        both
154  2018-01-09           2        both
53   2017-10-01           2        both
153  2018-01-09           3        both
52   2017-10-01           3        both
152  2018-01-09           3        both
51   2017-10-01           1        both
50   2017-10-01           1        both
49   2017-10-01           3        both
149  2018-01-09           3        both
48   2017-10-01           3        both
47   2017-10-01           4        both
46   2017-10-01           4        both
146  2018-01-09           4        both
45   2017-10-01           4        both
145  2018-01-09           3        both
44   2017-10-01           4        both
43   2017-10-01           2        both
143  2018-01-09           3        both
42   2017-10-01           2        both
141  2018-01-09           3        both
41   2017-10-01           2        both
140  2018-01-09           2        both
40   2017-10-01           3        both
39   2017-10-01           4        both
138  2018-01-09           2        both
38   2017-10-01           2        both
37   2017-10-01           2        both
36   2017-10-01           3        both
35   2017-10-01           1        both
34   2017-10-01           4        both
134  2018-01-09           3        both
133  2018-01-09           3        both
33   2017-10-01           2        both
132  2018-01-09           3        both
32   2017-10-01           1        both
131  2018-01-09           1        both
31   2017-10-01           2        both
30   2017-10-01           3        both
29   2017-10-01           2        both
129  2018-01-09           2        both
28   2017-10-01           2        both
27   2017-10-01           3        both
127  2018-01-09           2        both
26   2017-10-01           3        both
25   2017-10-01           2        both
24   2017-10-01           2        both
23   2017-10-01           2        both
122  2018-01-09           4        both
22   2017-10-01           4        both
21   2017-10-01           1        both
121  2018-01-09           1        both
20   2017-10-01           1        both
120  2018-01-09           2        both
19   2017-10-01           3        both
18   2017-10-01           2        both
118  2018-01-09           4        both
17   2017-10-01           4        both
16   2017-10-01           1        both
116  2018-01-09           2        both
15   2017-10-01           4        both
14   2017-10-01           3        both
13   2017-10-01           2        both
12   2017-10-01           2        both
112  2018-01-09           2        both
11   2017-10-01           3        both
111  2018-01-09           4        both
10   2017-10-01           3        both
9    2017-10-01           1        both
8    2017-10-01           1        both
7    2017-10-01           1        both
107  2018-01-09           1        both
106  2018-01-09           3        both
6    2017-10-01           4        both
5    2017-10-01           2        both
104  2018-01-09           4        both
4    2017-10-01           4        both
3    2017-10-01           4        both
2    2017-10-01           3        both
102  2018-01-09           3        both
1    2017-10-01           3        both
101  2018-01-09           3        both
0    2017-10-01           1        both

200

In [ ]:
#convert to CSV
df_merged.to_csv('matched_student_data.csv', columns=['student_id', 'test_date', 'test_score'], index=False)

#print match counts for each column, showing how many values are not null (i.e. how many matches there are for each column)
print('Match counts: ')
print(df_merged.notna().value_counts() )
#prints 200 because we converted all null values to 0 in the student_id and site_id columns, so there are no null values in those columns.

#calculate the match rate by dividing the number of matched tests (rows where '_merge' is 'both') by the total number of tests 
#(rows where '_merge' is either 'both' or 'right_only')
total_tests = df_merged['_merge'].isin(['both', 'right_only']).sum()
matched_tests = (df_merged['_merge'] == 'both').sum()
print(matched_tests)
match_rate = matched_tests / total_tests
print(match_rate)

Match counts:
student_id  last_name  first_name  site_id  test_date  test_score  _merge
True        True       True        True     True       True        True      200
Name: count, dtype: int64
137
0.685